In [1]:
"""
This file generates queries given input tables, text and annotations data. We evaluate the results of the queries
based on the input tables
"""

'\nThis file generates queries given input tables, text and annotations data. We evaluate the results of the queries\nbased on the input tables\n'

In [21]:
import pandas as pd
import pandasql as ps
import os

In [11]:
TABLES = "../data/demo_tables/"

In [15]:
table1_path = os.path.join(TABLES, "demo_table1.csv")
table1_df = pd.read_csv(table1_path)
table1_df.rename(columns={"Unnamed: 0": "row_name"}, inplace=True)

In [16]:
table1_df

                  row_name  2016   2017e  2030    2035      2040
0            North America  1840    1225    3345    2625      1088
1  Central & South America  1055    3478    2059    2766      5706
2                   Europe  2822    5350    4937    3817      4624
3                   Africa  3419    1474    2483    4127      4155
4              Middle East  2918    5331    5508    2700      2540
5                  Eurasia  5443    3825    2325    5472      4088
6             Asia Pacific  4348    3025    1544    2775     13690
7                    World   895  25 679    2240    5202  37 114

In [17]:
table2_path = os.path.join(TABLES, "demo_table2.csv")
table2_df = pd.read_csv(table2_path)
table2_df.rename(columns={"Unnamed: 0": "row_name"}, inplace=True)

In [18]:
table2_df

                row_name  2016  2017e  2025  2030    2035    2040
0     CO2 emissions (Mt)  3851   4956  5776    5927    1758    3187
1  Intensity (g CO2/kWh)   825    484  1330    1995    3676      69

In [19]:
table3_path = os.path.join(TABLES, "demo_table3.csv")
table3_df = pd.read_csv(table3_path)
table3_df.rename(columns={"Unnamed: 0": "row_name"}, inplace=True)

In [20]:
table3_df

    row_name    2000     2016     2017e    2025     2030     2035     2040
0  Total CO2  28 219   33 228   25 202   32 830   29 960   29 705   35 881
1       Coal     9683    13494     5875    12224    12373     9160    15327
2        Oil     6923     5953     6560     8427     8257     6427    11315
3        Gas    11613    13781    12767    12179     9330    14118    11950

In [65]:
demo_query = "SELECT t1.'2016' from table1_df as t1 WHERE t1.'row_name' == 'North America'"

In [66]:
ps.sqldf(demo_query, locals())

   2016
0  1840

In [67]:
list(table1_df.row_name)

['North America',
 'Central & South America',
 'Europe',
 'Africa',
 'Middle East',
 'Eurasia',
 'Asia Pacific',
 'World']

In [76]:
def execute_query(query):
    """
    executes the query and returns a Dataframe
    """
    try:
        df = ps.sqldf(query, locals())
        return df
    except:
        return

In [79]:
def existence_query_generation(df, claim_value):
    queries_list = []
    columns = list(df.columns)
    rows = list(df.row_name)
    for column in columns:
        for row in rows:
            query = "SELECT t.'{}' from df as t WHERE t.'row_name' == '{}'".format(column, row)
            queries_list.append(query)
            
    print("Generated {} queries".format(len(queries_list)))
    return queries_list

In [80]:
existence_query_generation(table1_df, 1)

Generated 48 queries

["SELECT t.'row_name' from df as t WHERE t.'row_name' == 'North America'",
 "SELECT t.'row_name' from df as t WHERE t.'row_name' == 'Central & South America'",
 "SELECT t.'row_name' from df as t WHERE t.'row_name' == 'Europe'",
 "SELECT t.'row_name' from df as t WHERE t.'row_name' == 'Africa'",
 "SELECT t.'row_name' from df as t WHERE t.'row_name' == 'Middle East'",
 "SELECT t.'row_name' from df as t WHERE t.'row_name' == 'Eurasia'",
 "SELECT t.'row_name' from df as t WHERE t.'row_name' == 'Asia Pacific'",
 "SELECT t.'row_name' from df as t WHERE t.'row_name' == 'World'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'North America'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'Central & South America'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'Europe'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'Africa'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'Middle East'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'Eurasia'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'Asia Pacific'",
 "SELECT t.'2016' from df as t WHERE t.'row_name' == 'World'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'North America'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'Central & South America'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'Europe'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'Africa'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'Middle East'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'Eurasia'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'Asia Pacific'",
 "SELECT t.'2017e' from df as t WHERE t.'row_name' == 'World'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'North America'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'Central & South America'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'Europe'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'Africa'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'Middle East'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'Eurasia'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'Asia Pacific'",
 "SELECT t.'2030  ' from df as t WHERE t.'row_name' == 'World'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'North America'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'Central & South America'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'Europe'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'Africa'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'Middle East'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'Eurasia'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'Asia Pacific'",
 "SELECT t.'2035  ' from df as t WHERE t.'row_name' == 'World'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'North America'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'Central & South America'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'Europe'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'Africa'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'Middle East'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'Eurasia'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'Asia Pacific'",
 "SELECT t.'2040  ' from df as t WHERE t.'row_name' == 'World'"]

In [81]:
def query_generation(claim_text, claim_values, df_list):
    """
    generate queries based on the input claims and the dataframes
    """
    return existence_query_generation

In [ ]:
def query_execution(claim_text, claim_values, df_list):